# Missing Data

In [1]:
import numpy as np
import pandas as pd

dibawah ini yg bakalan di pake,
lengkapnya nonton video

In [3]:
# kalo pandas lama bakalan muncul ini
np.nan # not a number

nan

In [4]:
# pandas baru mungkin bakal muncul ini
pd.NA

In [5]:
# dan ada ini juga
pd.NaT # not a timestamp

NaT

In [6]:
# kalo mau cek value nan atau ga jangan pake ==. pake is
np.nan == np.nan

False

In [7]:
# banyak orang ngira kalo stmt diatas true, tapi nyatanya
# karena nan, jadi valuenya ga diketahui jadi gatau sama atau ga

In [9]:
# pake ini
np.nan is np.nan

True

In [10]:
# atau ini
np.nan in [np.nan]

True

In [12]:
# contoh mau cek
myvar = np.nan
myvar is np.nan

True

## Data
Data aktor terus orang2 disuruh rate 1-10 sebelum nonton sama setelah

In [13]:
df = pd.read_csv('E:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\movie_scores.csv')

In [14]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [15]:
# bisa di liat datanya bolong2 banyak NaN

In [16]:
# cara cek null values
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [17]:
# kebalikannya
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [18]:
# skrg coba kita liat yg pre movie score nya kosong siapa aja

In [19]:
df['pre_movie_score'].notnull()

0     True
1    False
2    False
3     True
4     True
Name: pre_movie_score, dtype: bool

In [20]:
# kita masukin ke df biar muncul dataframenya
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [21]:
# atau kita munculin dataframe yg premoviescorenya kosong
df[df['pre_movie_score'].isnull()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [22]:
# bisa juga pake multiple condition
df[(df['pre_movie_score'].isnull()) & df['sex'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

In [23]:
# KEEP DATA
# DROP DATA
# FILL DATA

In [24]:
# Keep data paling gampang gausah ngapa2in

## Drop data

In [25]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [28]:
# liat documentationnya
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        .. versionchanged:: 1.0.0

           Pass tuple or list to drop on multiple axes.
           Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values.
    subset : array-like, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        If True, do operation inplace and return None.

    Returns
    -------
    DataFrame or None
        DataFrame with NA entries dropped from it or None if ``inplace=True``.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'toy'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

In [29]:
# kalo langsung dropna, dia default axis=0 terus langsung drop yang nan
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [34]:
# thresh (threshhold) itu buat tentuin mau display brp data yang non-NA(alias ada) (bisa liat di docsnya)
df.dropna(thresh=1) # mau display yg seengganya ada 1 data
# yang semua NaN ilang soalnya dia thresh=0 sama sekali ga ada data

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [35]:
# Hugh Jackman itu thresh 4, karena datanya cuma 4, kalo thresh 5 pasti dia juga ilang
df.dropna(thresh=4)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [36]:
df.dropna(thresh=5) # kan hilang

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [37]:
# ada parameter axis juga, defaultnya itu 0
# artinya dia bakal delete semua row yg mengandung NaN
# kalo kita pake axis=1 berarti column
# dia bakal delete semua column yg ada NaN
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

dia ga ada data sama sekali karena index 1 semua nya NaN, jadi termasuk semua column jadi ilang

In [38]:
# kita coba combine mau thresh 4 axis 1 artinya column yg data nya kurang dari 4 ilang
df.dropna(thresh=4,axis=1)
# scorenya semua cuma thresh 3

  first_name last_name   age  sex
0        Tom     Hanks  63.0    m
1        NaN       NaN   NaN  NaN
2       Hugh   Jackman  51.0    m
3      Oprah   Winfrey  66.0    f
4       Emma     Stone  31.0    f

In [45]:
# ada lagi subset
# jadi subset cuma bakalan consider column itu aja
df.dropna(subset=['last_name']) # pake list
# dia cuma consider yang NaN di column last_name

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [39]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

## Fill data

In [ ]:
# tadi drop data, skrg fill

In [40]:
df.fillna('New Value')
# langsung isi semua yg NaN dengan yg kita mau
# tapi sebenernya bukan kaya gini yg kita mau
# kalo kaya gini yang bagian age nya harusnya int jadi str
# kalo udah begini, pandas bakal otomatis ngubah semua column itu jadi string

  first_name  last_name        age        sex pre_movie_score post_movie_score
0        Tom      Hanks       63.0          m             8.0             10.0
1  New Value  New Value  New Value  New Value       New Value        New Value
2       Hugh    Jackman       51.0          m       New Value        New Value
3      Oprah    Winfrey       66.0          f             6.0              8.0
4       Emma      Stone       31.0          f             7.0              9.0

In [41]:
# tapi harusnya isi sesuai columnnya aja
df['first_name'].fillna('Calvin')

0       Tom
1    Calvin
2      Hugh
3     Oprah
4      Emma
Name: first_name, dtype: object

In [42]:
# kaya gini baru keubah permanen
df['first_name'] = df['first_name'].fillna('Calvin')

In [43]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1     Calvin       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [55]:
df['pre_movie_score'] = df['pre_movie_score'].fillna(0)

In [56]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1     Calvin       NaN   NaN  NaN              0.0               NaN
2       Hugh   Jackman  51.0    m              0.0               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [60]:
# misal kita mau isi post movie scorenya pake rata2
df['post_movie_score'].mean()

9.0

In [61]:
df['post_movie_score'] = df['post_movie_score'].fillna(df['post_movie_score'].mean())

In [62]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1     Calvin       NaN   NaN  NaN              0.0               9.0
2       Hugh   Jackman  51.0    m              0.0               9.0
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [63]:
# kalo mau langsung isi semua numeric column pake mean juga bisa
df.fillna(df.mean())
# agenya jadi keisi

  first_name last_name    age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.00    m              8.0              10.0
1     Calvin       NaN  52.75  NaN              0.0               9.0
2       Hugh   Jackman  51.00    m              0.0               9.0
3      Oprah   Winfrey  66.00    f              6.0               8.0
4       Emma     Stone  31.00    f              7.0               9.0

In [64]:
# contoh lain pake interpolation
# harus hati2 pake method ini soalnya ga semua case cocok
# pake contoh buat series baru
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}

In [65]:
ser = pd.Series(airline_tix)

In [66]:
# ada 1 data kosong, interpolate itu nyari hubungannya, berarti harusnya nilainya di antara 50 dan 100
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [67]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64